# DividedSurfacePatternLinesStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DividedSurfacePatternLinesStyle Property
ParameterTypeId Class See Also
---
"Pattern Lines Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DividedSurfacePatternLinesStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DividedSurfacePatternLinesStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DividedSurfacePatternLinesStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace